Тест1/src/Catalogs/Контрагенты/Контрагенты.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>Контрагенты</name>
  <attributes>
    <name>ФИО</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Телефон</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Страна</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Город</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Скидка</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ПолноеНаименование</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ИНН</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>12</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>КПП</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>9</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>КодПоОКПО</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ЮридическийАдрес</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ФактическийАдрес</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>РеквизитТелефон</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Область</name>
    <type>
      <types>CatalogRef.Область</types>
    </type>
  </attributes>
  <attributes>
    <name>Email</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>150</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Город2</name>
    <type>
      <types>CatalogRef.Город</types>
    </type>
  </attributes>
  <attributes>
    <name>Страна2</name>
    <type>
      <types>CatalogRef.Страна</types>
    </type>
  </attributes>
  <attributes>
    <name>Ответственный</name>
    <type>
      <types>CatalogRef.Сотрудники</types>
    </type>
  </attributes>
  <attributes>
    <name>ТипПродукции</name>
    <type>
      <types>EnumRef.ТипыПродукцииПоставщиков</types>
    </type>
  </attributes>
  <attributes>
    <name>ЮрФизЛицо</name>
    <type>
      <types>EnumRef.дт_ТипыКлиентов</types>
    </type>
  </attributes>
  <tabularSections>
    <name>Машины</name>
    <attributes>
      <name>Машина</name>
      <type>
        <types>CatalogRef.МашиныКлиентов</types>
      </type>
    </attributes>
    <attributes>
      <name>Комментарий</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ДополнительныеКонтакты</name>
    <attributes>
      <name>Телефон</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
    <attributes>
      <name>ФИО</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
    <attributes>
      <name>Дополнительно</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

Тест1/src/Catalogs/Контрагенты/Forms/ФормаСписка/Module.bsl
&НаКлиенте
Процедура Поиск(Команда)
	// Вставить содержимое обработчика.
	Фильтр();
КонецПроцедуры


&НаСервере
Функция РазбитьСтрокуНаМассивПодстрок(ИсходнаяСтрока,РазделительСтрок)
   СтрокаДляРазбора = ИсходнаяСтрока;
   СтрокаДляРазбора = СтрЗаменить(СтрокаДляРазбора, РазделительСтрок, Символы.ПС);
   МассивСтрок = новый Массив;
   КолвоСтрок = СтрЧислоСтрок(СтрокаДляРазбора);
   Для НомСтр = 1 По КолвоСтрок Цикл
      МассивСтрок.Добавить(СтрПолучитьСтроку(СтрокаДляРазбора, НомСтр));
  КонецЦикла;
   Возврат МассивСтрок;
КонецФункции

&НаСервере
Функция Фильтр() Экспорт
	Перем а;
	Мас = РазбитьСтрокуНаМассивПодстрок(Поиск," ");
	Кол = Мас.Количество();
	Коды = Новый Массив();
	Запрос = Новый Запрос();
	ПоискПо = "ГДЕ "; 
Если Кол > 0 Тогда
		а=0;
		ПоискПо = ПоискПо + " ( ";
		Пока а < Кол Цикл
			Если а = 0 Тогда
				ПоискПо = ПоискПо + " СправочникКлиенты.Наименование ПОДОБНО ""%"+Мас[а]+"%""";
			Иначе
				ПоискПо = ПоискПо + " И СправочникКлиенты.Наименование ПОДОБНО ""%"+Мас[а]+"%""";
			КонецЕсли;
			а = а + 1;
		КонецЦикла;
		ПоискПо = ПоискПо + " ) ";
	КонецЕсли;
	
Если Кол > 0 Тогда
		а=0;
		ПоискПо = ПоискПо + " ИЛИ ( ";
		Пока а < Кол Цикл
			Если а = 0 Тогда
				ПоискПо = ПоискПо + " СправочникКлиенты.ФИО ПОДОБНО ""%"+Мас[а]+"%""";
			Иначе
				ПоискПо = ПоискПо + " И СправочникКлиенты.ФИО ПОДОБНО ""%"+Мас[а]+"%""";
			КонецЕсли;
			а = а + 1;
		КонецЦикла;
		ПоискПо = ПоискПо + " ) ";
	КонецЕсли;

	Если Кол > 0 Тогда
		а=0;
		ПоискПо = ПоискПо + " ИЛИ ( ";
		Пока а < Кол Цикл
			Если а = 0 Тогда
				ПоискПо = ПоискПо + " СправочникКлиенты.Телефон ПОДОБНО ""%"+Мас[а]+"%""";
			Иначе
				ПоискПо = ПоискПо + " И СправочникКлиенты.Телефон ПОДОБНО ""%"+Мас[а]+"%""";
			КонецЕсли;
			а = а + 1;
		КонецЦикла;
		ПоискПо = ПоискПо + " ) ";
	КонецЕсли;
	
	Если Кол > 0 Тогда
		а=0;
		ПоискПо = ПоискПо + " ИЛИ ( ";
		Пока а < Кол Цикл
			Если а = 0 Тогда
				ПоискПо = ПоискПо + " СправочникКлиенты.Город ПОДОБНО ""%"+Мас[а]+"%""";
			Иначе
				ПоискПо = ПоискПо + " И СправочникКлиенты.Город ПОДОБНО ""%"+Мас[а]+"%""";
			КонецЕсли;
			а = а + 1;
		КонецЦикла;
		ПоискПо = ПоискПо + " ) ";
	КонецЕсли;
	
	Если Кол > 0 Тогда
		а=0;
		ПоискПо = ПоискПо + " ИЛИ ( ";
		Пока а < Кол Цикл
			Если а = 0 Тогда
				ПоискПо = ПоискПо + " СправочникКлиенты.Область.Наименование ПОДОБНО ""%"+Мас[а]+"%""";
			Иначе
				ПоискПо = ПоискПо + " И СправочникКлиенты.Область.Наименование ПОДОБНО ""%"+Мас[а]+"%""";
			КонецЕсли;
			а = а + 1;
		КонецЦикла;
		ПоискПо = ПоискПо + " ) ";
	КонецЕсли;

	
	Список.ТекстЗапроса = "ВЫБРАТЬ
	                      |	СправочникКлиенты.Ссылка,
	                      |	СправочникКлиенты.ВерсияДанных,
	                      |	СправочникКлиенты.ПометкаУдаления,
	                      |	СправочникКлиенты.Предопределенный,
	                      |	СправочникКлиенты.Код,
	                      |	СправочникКлиенты.Наименование,
	                      |	СправочникКлиенты.ФИО,
	                      |	СправочникКлиенты.Телефон,
	                      |	СправочникКлиенты.Страна,
	                      |	СправочникКлиенты.Город,
	                      |	СправочникКлиенты.Скидка,
	                      |	СправочникКлиенты.Комментарий,
	                      |	СправочникКлиенты.ПолноеНаименование,
	                      |	СправочникКлиенты.ИНН,
	                      |	СправочникКлиенты.КПП,
	                      |	СправочникКлиенты.КодПоОКПО,
	                      |	СправочникКлиенты.ЮридическийАдрес,
	                      |	СправочникКлиенты.ФактическийАдрес,
	                      |	СправочникКлиенты.РеквизитТелефон
	                      |ИЗ
	                      |	Справочник.Контрагенты КАК СправочникКлиенты " + ПоискПо;
	Сообщить(Список.ТекстЗапроса);
КонецФункции

&НаКлиенте
Процедура Очистить(Команда)
	// Вставить содержимое обработчика.
	ОчиститьПоиск();
КонецПроцедуры


&НаСервере
Процедура ОчиститьПоиск()
	Список.ТекстЗапроса = "ВЫБРАТЬ
	                      |	СправочникКлиенты.Ссылка,
	                      |	СправочникКлиенты.ВерсияДанных,
	                      |	СправочникКлиенты.ПометкаУдаления,
	                      |	СправочникКлиенты.Предопределенный,
	                      |	СправочникКлиенты.Код,
	                      |	СправочникКлиенты.Наименование,
	                      |	СправочникКлиенты.ФИО,
	                      |	СправочникКлиенты.Телефон,
	                      |	СправочникКлиенты.Страна,
	                      |	СправочникКлиенты.Город,
	                      |	СправочникКлиенты.Скидка,
	                      |	СправочникКлиенты.Комментарий,
	                      |	СправочникКлиенты.ПолноеНаименование,
	                      |	СправочникКлиенты.ИНН,
	                      |	СправочникКлиенты.КПП,
	                      |	СправочникКлиенты.КодПоОКПО,
	                      |	СправочникКлиенты.ЮридическийАдрес,
	                      |	СправочникКлиенты.ФактическийАдрес,
	                      |	СправочникКлиенты.РеквизитТелефон
	                      |ИЗ
	                      |	Справочник.Контрагенты КАК СправочникКлиенты ";
КонецПроцедуры


&НаКлиенте
Процедура СоздатьПродажу(Команда)
	// Вставить содержимое обработчика.
	// ++ obrv 22.01.18
	//Док = СоздатьДок(Элементы.Список.ТекущаяСтрока.Код);
	Док = СоздатьДок(Элементы.Список.ТекущиеДанные.Код);
	// -- obrv 22.01.18
	Док.ПолучитьФорму().ОткрытьМодально();;
КонецПроцедуры

&НаСервере
Функция СоздатьДок(Код)
	Док = Документы.ПродажаЗапчастей.СоздатьДокумент();
	Док.Клиент = Справочники.Клиенты.НайтиПоКоду(Код);
	Док.Дата = ТекущаяДата();
	Док.КтоПродал = НайтиПользователя();
	Док.Записать();
	Возврат Док.Ссылка;
КонецФункции


&НаСервере
Функция НайтиПользователя()
	// ++ obrv 16.01.18
	//Возврат Справочники.Пользователи.НайтиПоНаименованию(ИмяПользователя());
	Возврат ПользователиКлиентСервер.ТекущийПользователь();
	// -- obrv 16.01.18
КонецФункции

&НаКлиенте
Процедура ПокупкиКлиента(Команда)
	// Вставить содержимое обработчика.
	ф = ПолучитьФорму("Обработка.ПокупкиКлиентов.Форма.Форма");
	// ++ obrv 22.01.18
	//ф.Клиент2 =  КлиентЭл(Элементы.Список.ТекущаяСтрока.Код);
	ф.Клиент2 =  КлиентЭл(Элементы.Список.ТекущиеДанные.Код);
	// -- obrv 22.01.18
	ф.откК2 = Истина;
	ф.ОткрытьМодально();
КонецПроцедуры

&НаСервере
Функция КлиентЭл(Код)
	Возврат Справочники.Контрагенты.НайтиПоКоду(Код);
КонецФункции

&НаСервере
Функция ПокупкиКлентов()
	ф = Обработки.ПокупкиКлиентов.Создать().ПолучитьФорму();
	// ++ obrv 22.01.18
	//ф.Клиент =  КлиентЭл(Элементы.Список.ТекущаяСтрока.Код);
	ф.Клиент =  КлиентЭл(Элементы.Список.ТекущиеДанные.Код);
	// -- obrv 22.01.18
	ф.ОткрытьМодально();

	Возврат 1;
КонецФункции
